tutorials/movingMeshRhoPimpleDyMFoam_roundHole/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    sides
    {
        type            calculated;
        value           uniform 1;
    }
    top
    {
        type            calculated;
        value           uniform 1;
    }
    inlet
    {
        type            calculated;
        value           uniform 1;
    }
    bottom
    {
        type            calculated;
        value           uniform 1;
    }
    outlet
    {
        type            calculated;
        value           uniform 1;
    }
    ring
    {
        type            calculated;
        value           uniform 1;
    }
    defaultFaces
    {
        type            calculated;
        value           uniform 1;
    }
}


// ************************************************************************* //
