tutorials/movingMeshRhoPimpleDyMFoam_roundHole/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    sides
    {
        type            patch;
        physicalType    patch;
        nFaces          40;
        startFace       13240;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          40;
        startFace       13280;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          30;
        startFace       13320;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          40;
        startFace       13350;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          30;
        startFace       13390;
    }
    ring
    {
        type            patch;
        physicalType    patch;
        nFaces          12;
        startFace       13420;
    }
    defaultFaces
    {
        type            patch;
        nFaces          4656;
        startFace       13432;
    }
)

// ************************************************************************* //
